from django.test import TestCase

# Create your tests here.
#TODO ниже
'''
    Написать unit-тесты:  
        Для модуля аккаунтов  — проверить корректность логики (валидация данных, создание/обновление/удаление аккаунтов).
        Для модуля записок  — протестировать CRUD-операции, валидацию содержимого, привязку к аккаунтам.
         

    Написать интеграционные тесты:  
        Проверить взаимодействие между аккаунтами  и записками :
            Создание записки от имени конкретного аккаунта.
            Доступ к запискам только для владельца.
            Обновление/удаление записок с учётом принадлежности аккаунту.
'''